[
  {
    "title": "MOTOTRBO R7 User Guide",
    "url": "https://docs.motorolasolutions.com/example/r7-user-guide",
    "content_snippet": "The MOTOTRBO R7 is a professional digital radio designed for mission-critical communications. This guide covers basic operations, programming, and troubleshooting. Key features include: Enhanced audio quality, integrated Bluetooth, GPS tracking, and emergency alert capabilities. The R7 supports both DMR and analog modes for seamless migration from legacy systems.",
    "full_content": "The MOTOTRBO R7 is a professional digital radio designed for mission-critical communications...",
    "links": 15,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Comprehensive user guide for the MOTOTRBO R7 digital radio covering setup, programming, operations, and troubleshooting. Includes information on DMR/analog modes, Bluetooth connectivity, GPS features, and emergency functions."
  },
  {
    "title": "CPS Software Download and Installation",
    "url": "https://docs.motorolasolutions.com/example/cps-download-guide",
    "content_snippet": "Customer Programming Software (CPS) is required to program MOTOTRBO radios. This guide explains how to download, install, and use CPS for radio programming. CPS allows you to configure channels, zones, contacts, and advanced features. Compatible with Windows 10 and Windows 11.",
    "full_content": "Customer Programming Software (CPS) is required to program MOTOTRBO radios...",
    "links": 8,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Step-by-step guide for downloading and installing Customer Programming Software (CPS) used to configure MOTOTRBO radios. Covers system requirements, installation process, and basic programming workflow."
  },
  {
    "title": "APX 4000 Radio Password Reset",
    "url": "https://docs.motorolasolutions.com/example/apx-password-reset",
    "content_snippet": "To reset the password on an APX 4000 radio, you must use the CPS software with administrator credentials. Connect the radio via USB programming cable, launch CPS, and navigate to Security settings. Select 'Reset Device Password' and follow the prompts. Note: This requires authorized access and may require contacting Motorola support for verification.",
    "full_content": "To reset the password on an APX 4000 radio...",
    "links": 5,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Instructions for resetting passwords on APX 4000 series radios using CPS software. Covers security procedures, administrator access requirements, and step-by-step reset process."
  },
  {
    "title": "WAVE PTX Setup and Configuration",
    "url": "https://docs.motorolasolutions.com/example/wave-ptx-setup",
    "content_snippet": "WAVE PTX is a push-to-talk application that extends two-way radio communications to smartphones and other devices. This guide covers initial setup, account creation, channel configuration, and user management. WAVE PTX enables nationwide PTT coverage using cellular or Wi-Fi networks.",
    "full_content": "WAVE PTX is a push-to-talk application...",
    "links": 12,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Setup and configuration guide for WAVE PTX push-to-talk application. Includes account setup, channel creation, user management, and integration with MOTOTRBO radio systems."
  },
  {
    "title": "Video Security Camera Troubleshooting",
    "url": "https://docs.motorolasolutions.com/example/camera-troubleshooting",
    "content_snippet": "Common issues with Motorola video security cameras and solutions. Topics include: camera not connecting to network, poor video quality, firmware update failures, and password recovery. For password recovery, use the reset button on the camera housing or access the web interface with administrator credentials.",
    "full_content": "Common issues with Motorola video security cameras...",
    "links": 18,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Troubleshooting guide for Motorola video security cameras covering network connectivity issues, video quality problems, firmware updates, and password recovery procedures."
  },
  {
    "title": "Firmware Update Procedures for MOTOTRBO Radios",
    "url": "https://docs.motorolasolutions.com/example/firmware-update-guide",
    "content_snippet": "Keeping your MOTOTRBO radio firmware up to date ensures optimal performance and security. This guide covers: checking current firmware version, downloading updates from Motorola Online, using CPS to flash firmware, and troubleshooting failed updates. Always back up your radio configuration before updating.",
    "full_content": "Keeping your MOTOTRBO radio firmware up to date...",
    "links": 10,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Complete guide for updating firmware on MOTOTRBO radios including version checking, download procedures, installation via CPS software, backup recommendations, and troubleshooting update failures."
  },
  {
    "title": "Radio Programming Basics",
    "url": "https://docs.motorolasolutions.com/example/programming-basics",
    "content_snippet": "Learn the fundamentals of programming Motorola radios using CPS software. Topics include: creating channels, organizing zones, setting up talk groups, configuring scan lists, and programming function buttons. This guide assumes basic familiarity with two-way radio concepts.",
    "full_content": "Learn the fundamentals of programming Motorola radios...",
    "links": 14,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Beginner's guide to radio programming covering channel creation, zone organization, talk group setup, scan list configuration, and button programming using CPS software."
  },
  {
    "title": "Connection Issues with MOTOTRBO Repeaters",
    "url": "https://docs.motorolasolutions.com/example/repeater-connection-issues",
    "content_snippet": "Troubleshooting connection problems between MOTOTRBO radios and repeaters. Common causes include: incorrect frequency settings, mismatched color codes, network ID errors, and antenna issues. Check radio programming matches repeater configuration. Verify line of sight and signal strength.",
    "full_content": "Troubleshooting connection problems between MOTOTRBO radios and repeaters...",
    "links": 9,
    "source_type": "docs",
    "crawled_at": "2025-12-02T16:00:00.000000",
    "description": "Diagnostic guide for resolving connectivity issues between MOTOTRBO portable/mobile radios and repeater infrastructure. Covers frequency settings, color codes, network IDs, and signal strength troubleshooting."
  }
]
